--не менее 8 исполнителей
INSERT INTO Executor(name)
VALUES
('Иосиф Кобзон'),
('Eminem'),
('Розенбаум'),
('АББА'),
('Мадонна'),
('Майкл Джексон'),
('ACDC'),
('Баста');

--не менее 5 жанров
INSERT INTO Genre(name)
VALUES
('Pop'),
('Rap'),
('Dance'),
('Rok'),
('Русские народные');

--зависимости жанр-исполнитель
INSERT INTO GenreExecutor(genre_id, executor_id)
VALUES
(1, 1),
(2, 2),
(5, 3),
(1, 4),
(3, 5),
(1, 6),
(4, 7),
(2, 8);

--не менее 8 альбомов
INSERT INTO Album(name, year)
VALUES
('1 альбом',2018),
('2 альбом', 2015),
('3 альбом', 2000),
('4 альбом', 2018),
('5 альбом', 2022),
('6 альбом', 2023),
('7 альбом', 2018),
('8 альбом', 2020);

--зависимости исполнитель-альбом
INSERT INTO ExecutorAlbum(album_id, executor_id)
VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 6),
(7, 7),
(8, 8);

--не менее 15 треков
INSERT INTO track(name, length, album_id)
VALUES
('1 трек my', '03:50:00', 2),
('2 трек', '03:00:00', 3),
('3 трек', '02:50:00', 4),
('4 трек', '07:50:00', 5),
('5 трек', '05:50:00', 6),
('6 трек', '01:50:00', 7),
('7 трек my', '01:11:00', 8),
('8 трек', '15:50:00', 1),
('9 трек','03:29:00', 2),
('10 трек мой', '03:31:00', 3),
('11 трек', '01:49:00', 4),
('12 трек', '00:50:00', 5),
('13 трек', '07:50:00', 6),
('14 трек', '02:59:00', 7),
('15 трек мой', '09:50:00', 8),
('16 трек', '01:29:05', 2);

--не менее 8 сборников
INSERT INTO collection(name, year)
VALUES
('1 сборник', 2022),
('2 сборник', 2003),
('3 сборник', 1989),
('4 сборник', 2025),
('5 сборник', 2019),
('6 сборник', 2012),
('7 сборник', 2013),
('8 сборник', 2020);

--зависимости трек-сборник
INSERT INTO TrackCollection(track_id, collection_id)
VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 6),
(7, 7),
(8, 8),
(9, 1),
(10, 2),
(11, 3),
(12, 4),
(13, 5),
(14, 6),
(15, 7),
(16, 8);

